IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/LFSS_1.0.xml
    <register id="LFSS_SPMTERASE2" width="32" offset="0x1548" description="Scratch Pad Memory Tamper Erase Register 2">
        <bitfield id="TE_11_3" description="tamper erase enable SPMEM11 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_11_2" description="tamper erase enable SPMEM11 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_11_1" description="tamper erase enable SPMEM11 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_11_0" description="tamper erase enable SPMEM11 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_10_3" description="tamper erase enable SPMEM10 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_10_2" description="tamper erase enable SPMEM10 - DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_10_1" description="tamper erase enable SPMEM10 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_10_0" description="tamper erase enable SPMEM10 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_9_3" description="tamper erase enable SPMEM9 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_9_2" description="tamper erase enable SPMEM9 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_9_1" description="tamper erase enable SPMEM9 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_9_0" description="tamper erase enable SPMEM9 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_8_3" description="tamper erase enable SPMEM8 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_8_2" description="tamper erase enable SPMEM8 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_8_1" description="tamper erase enable SPMEM8 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_8_0" description="tamper erase enable SPMEM8 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
    </register>
    <register id="LFSS_SPMTERASE3" width="32" offset="0x154C" description="Scratch Pad Memory Tamper Erase Register 3">
        <bitfield id="TE_15_3" description="tamper erase enable SPMEM15 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_15_2" description="tamper erase enable SPMEM15 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_15_1" description="tamper erase enable SPMEM15 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_15_0" description="tamper erase enable SPMEM15 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_14_3" description="tamper erase enable SPMEM14 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_14_2" description="tamper erase enable SPMEM14 - DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_14_1" description="tamper erase enable SPMEM14 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_14_0" description="tamper erase enable SPMEM14 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_13_3" description="tamper erase enable SPMEM13 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_13_2" description="tamper erase enable SPMEM13 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_13_1" description="tamper erase enable SPMEM13 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_13_0" description="tamper erase enable SPMEM13 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_12_3" description="tamper erase enable SPMEM12 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_12_2" description="tamper erase enable SPMEM12 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_12_1" description="tamper erase enable SPMEM12 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_12_0" description="tamper erase enable SPMEM12 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
    </register>
    <register id="LFSS_SPMTERASE4" width="32" offset="0x1550" description="Scratch Pad Memory Tamper Erase Register 4">
        <bitfield id="TE_19_3" description="tamper erase enable SPMEM19 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_19_2" description="tamper erase enable SPMEM19 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_19_1" description="tamper erase enable SPMEM19 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_19_0" description="tamper erase enable SPMEM19 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_18_3" description="tamper erase enable SPMEM18 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_18_2" description="tamper erase enable SPMEM18 - DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_18_1" description="tamper erase enable SPMEM18 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_18_0" description="tamper erase enable SPMEM18 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_17_3" description="tamper erase enable SPMEM17 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_17_2" description="tamper erase enable SPMEM17 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_17_1" description="tamper erase enable SPMEM17 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_17_0" description="tamper erase enable SPMEM17 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_16_3" description="tamper erase enable SPMEM16 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_16_2" description="tamper erase enable SPMEM16 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_16_1" description="tamper erase enable SPMEM16 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_16_0" description="tamper erase enable SPMEM16 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
    </register>
    <register id="LFSS_SPMTERASE5" width="32" offset="0x1554" description="Scratch Pad Memory Tamper Erase Register 5">
        <bitfield id="TE_23_3" description="tamper erase enable SPMEM23 - DATA3" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_23_2" description="tamper erase enable SPMEM23 - DATA2" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_23_1" description="tamper erase enable SPMEM23 - DATA1" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_23_0" description="tamper erase enable SPMEM23 - DATA0" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_22_3" description="tamper erase enable SPMEM22 - DATA3" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_22_2" description="tamper erase enable SPMEM22 - DATA2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_22_1" description="tamper erase enable SPMEM22 - DATA1" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_22_0" description="tamper erase enable SPMEM22 - DATA0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_21_3" description="tamper erase enable SPMEM21 - DATA3" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_21_2" description="tamper erase enable SPMEM21 - DATA2" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_21_1" description="tamper erase enable SPMEM21 - DATA1" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_21_0" description="tamper erase enable SPMEM21 - DATA0" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_20_3" description="tamper erase enable SPMEM20 - DATA3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_20_2" description="tamper erase enable SPMEM20 - DATA2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_20_1" description="tamper erase enable SPMEM20 - DATA1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
        <bitfield id="TE_20_0" description="tamper erase enable SPMEM20 - DATA0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SPMEM is unmodified during tamper event"/>
            <bitenum id="ENABLE" value="0x1" description="SPMEM will be erased with tamper event"/>
        </bitfield>
    </register>
